#pragma once

#if defined(ServerMainVers_2500)

    #include "json_commands/CommandBase.hpp"

class HealthCommand : public CommandBase {
  public:
    // -----------------------------------------------------------------------------
    // Создаёт команду проверки работоспособности аддона.
    // -----------------------------------------------------------------------------
    HealthCommand ();

    // -----------------------------------------------------------------------------
    // Возвращает имя команды проверки работоспособности.
    // -----------------------------------------------------------------------------
    virtual GS::String GetName () const override;

    // -----------------------------------------------------------------------------
    // Возвращает схему входных параметров команды.
    // -----------------------------------------------------------------------------
    virtual GS::Optional<GS::UniString> GetInputParametersSchema () const override;

    // -----------------------------------------------------------------------------
    // Возвращает схему ответа команды.
    // -----------------------------------------------------------------------------
    virtual GS::Optional<GS::UniString> GetResponseSchema () const override;

    // -----------------------------------------------------------------------------
    // Возвращает статус и версию аддона.
    // -----------------------------------------------------------------------------
    virtual GS::ObjectState Execute (const GS::ObjectState &parameters,
                                     GS::ProcessControl &processControl) const override;
};

#endif // defined (ServerMainVers_2500)
