#if !defined(MONALLCOMMAND_HPP)
#define MONALLCOMMAND_HPP
#include "CommandBase.hpp"
#include "dialogs/SyncSettings.hpp"

// -----------------------------------------------------------------------------
// Команда для включения/выключения мониторинга элементов (MonAll).
//
// Может принимать параметр `enable` для включения или выключения мониторинга.
// -----------------------------------------------------------------------------
class MonAllCommand : public ModifyCommand
{
public:
    MonAllCommand();
    
    // -------------------------------------------------------------------------
    // @return Имя команды JSON.
    // -------------------------------------------------------------------------
    virtual GS::String GetName() const override;

    // -------------------------------------------------------------------------
    // @return Схема входных параметров. В этой команде нет схемы.
    // -------------------------------------------------------------------------
    virtual GS::Optional<GS::UniString> GetInputParametersSchema() const override;

    // -------------------------------------------------------------------------
    // @return Схема ответа. В этой команде схема не задаётся.
    // -------------------------------------------------------------------------
    virtual GS::Optional<GS::UniString> GetResponseSchema() const override;

    // -------------------------------------------------------------------------
    // Выполняет команду и включает или отключает мониторинг.
    // -------------------------------------------------------------------------
    virtual GS::ObjectState Execute(const GS::ObjectState& parameters,
                                   GS::ProcessControl& processControl) const override;
};

#endif // MONALLCOMMAND_HPP
